## Final Project Submission

Please fill out:
* Student name: kipkosgei kiptui
* Student pace: full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

Microsoft, a technology giant, aims to venture into the world of original video content creation by establishing a new movie studio. However, lacking experience in the movie industry, Microsoft faces the challenge of identifying the most successful film genres in the current market. The objective is to provide actionable insights to guide Microsoft's new movie studio in determining the types of films to produce. 

objectives:

In [37]:
import pandas as pd
import sqlite3
import zipfile
import gzip

In [38]:
with zipfile.ZipFile('im.db.zip', 'r') as zip_ref:
    zip_ref.extractall()

Connect to the SQLite database

In [39]:
conn = sqlite3.connect('im.db')

In [4]:
#Load data from the movie_basics table in the SQLite database
movie_basics_query = "SELECT * FROM movie_basics"
movie_basics_df = pd.read_sql_query(movie_basics_query, conn)

In [5]:
#Load data from the movie_ratings table in the SQLite database
movie_ratings_query = "SELECT * FROM movie_ratings"
movie_ratings_df = pd.read_sql_query(movie_ratings_query, conn)

In [6]:
#Load data from the CSV file (box office gross data)
with gzip.open('bom.movie_gross.csv.gz', 'rb') as file:
    box_office_df = pd.read_csv(file)

Explore and understand the loaded dataframes
You can use functions like .head(), .info(), .describe(), etc., to get an overview of the data.

In [7]:
movie_basics_df.shape

(146144, 6)

In [8]:
#Sample records from movie_basics:
movie_basics_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [9]:
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [10]:
movie_basics_df.describe()

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [12]:
#Sample records from movie_ratings:
movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [11]:
movie_ratings_df.shape

(73856, 3)

In [12]:
movie_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [13]:
movie_ratings_df.describe()

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [14]:
#Sample records from movie_ratings:
movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [15]:
movie_ratings_df.shape

(73856, 3)

In [16]:
movie_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [25]:
#Sample records from box_office_df
box_office_df.head(10)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
5,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010
6,Iron Man 2,Par.,312400000.0,311500000,2010
7,Tangled,BV,200800000.0,391000000,2010
8,Despicable Me,Uni.,251500000.0,291600000,2010
9,How to Train Your Dragon,P/DW,217600000.0,277300000,2010

In [18]:
box_office_df.shape

(3387, 5)

In [19]:
box_office_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [20]:
box_office_df.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [21]:
box_office_df.shape

(3387, 5)

In [27]:
#Merge data from movie_basics_df and box_office_df based on 'movie_title'
merged_data = pd.merge(movie_basics_df, movie_ratings_df, on='movie_id', how='inner')

In [28]:
box_office_df.rename(columns={'title': 'primary_title'}, inplace=True)

In [29]:
# Merge data from movie_ratings_df and merged_data based on 'movie_title'
merged_data = pd.merge(merged_data, box_office_df, on='primary_title', how='inner')

In [30]:
#Check for Duplicate Values
duplicate_rows = merged_data[merged_data.duplicated(keep='first')]
if not duplicate_rows.empty:
    print("Duplicate rows found. Removing duplicates...")
    merged_data.drop_duplicates(keep='first', inplace=True)
else:
    print("No duplicate rows found.")

No duplicate rows found.

In [31]:
merged_data.drop_duplicates(inplace=True)

In [32]:
merged_data.dropna(inplace=True)

In [33]:
merged_data

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,studio,domestic_gross,foreign_gross,year
1,tt0337692,On the Road,On the Road,2012,124.0,"Adventure,Drama,Romance",6.1,37886,IFC,744000.0,8000000,2012
2,tt4339118,On the Road,On the Road,2014,89.0,Drama,6.0,6,IFC,744000.0,8000000,2012
3,tt5647250,On the Road,On the Road,2016,121.0,Drama,5.7,127,IFC,744000.0,8000000,2012
4,tt0359950,The Secret Life of Walter Mitty,The Secret Life of Walter Mitty,2013,114.0,"Adventure,Comedy,Drama",7.3,275300,Fox,58200000.0,129900000,2013
5,tt0365907,A Walk Among the Tombstones,A Walk Among the Tombstones,2014,114.0,"Action,Crime,Drama",6.5,105116,Uni.,26300000.0,26900000,2014
...,...,...,...,...,...,...,...,...,...,...,...,...
3008,tt7752454,Detective Chinatown 2,Tang ren jie tan an 2,2018,121.0,"Action,Comedy,Mystery",6.1,1250,WB,2000000.0,542100000,2018
3010,tt7784604,Hereditary,Hereditary,2018,127.0,"Drama,Horror,Mystery",7.3,151571,A24,44100000.0,35300000,2018
3017,tt8097306,Nobody's Fool,Nobody's Fool,2018,110.0,"Comedy,Drama,Romance",4.6,3618,Par.,31700000.0,1800000,2018
3023,tt8404272,How Long Will I Love U,Chao shi kong tong ju,2018,101.0,Romance,6.5,607,WGUSA,747000.0,82100000,2018
3026,tt9151704,Burn the Stage: The Movie,Burn the Stage: The Movie,2018,84.0,"Documentary,Music",8.8,2067,Trafalgar,4200000.0,16100000,2018

In [36]:
import matplotlib.pyplot as plt

In [35]:
# Group data by movie title to get the total gross revenue for each movie
movie_gross = merged_data.groupby('movie_title')['gross'].sum().reset_index()

KeyError: 'movie_title'